# Analyzing SAT Scores Across Public Schools in New York

In [ ]:
In this project,

In [1]:
import pandas as pd
import numpy as np

schools = pd.read_csv('schools.csv')
print(schools.info())
schools.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 375 entries, 0 to 374
Data columns (total 7 columns):
school_name        375 non-null object
borough            375 non-null object
building_code      375 non-null object
average_math       375 non-null int64
average_reading    375 non-null int64
average_writing    375 non-null int64
percent_tested     355 non-null float64
dtypes: float64(1), int64(3), object(3)
memory usage: 20.6+ KB
None

,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested
0,"New Explorations into Science, Technology and ...",Manhattan,M022,657,601,601,NaN
1,Essex Street Academy,Manhattan,M445,395,411,387,78.9
2,Lower Manhattan Arts Academy,Manhattan,M445,418,428,415,65.1
3,High School for Dual Language and Asian Studies,Manhattan,M445,613,453,463,95.9
4,Henry Street School for International Studies,Manhattan,M056,410,406,381,59.7

In [3]:
schools['total_SAT'] = schools[['average_math', 'average_reading', 'average_writing']].sum(axis=1).round(2)
largest_std_dev = schools.pivot_table(values='total_SAT', index='borough', aggfunc=['count', 'mean', 'std'])

In [11]:
schools.head()

,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested,total_SAT
0,"New Explorations into Science, Technology and ...",Manhattan,M022,657,601,601,NaN,1859
1,Essex Street Academy,Manhattan,M445,395,411,387,78.9,1193
2,Lower Manhattan Arts Academy,Manhattan,M445,418,428,415,65.1,1261
3,High School for Dual Language and Asian Studies,Manhattan,M445,613,453,463,95.9,1529
4,Henry Street School for International Studies,Manhattan,M056,410,406,381,59.7,1197

In [4]:
largest_std_dev.columns = ['num_schools', 'average_SAT', 'std_SAT']

In [5]:
largest_std_dev.sort_values('std_SAT', ascending=False, inplace=True)

In [6]:
largest_std_dev.reset_index(inplace=True)

In [7]:
largest_std_dev

         borough  num_schools  average_SAT     std_SAT
0      Manhattan           89  1340.134831  230.294140
1  Staten Island           10  1439.000000  222.303596
2         Queens           69  1345.478261  195.252899
3       Brooklyn          109  1230.256881  154.868427
4          Bronx           98  1202.724490  150.393901

In [8]:
largest_std_dev['prop_std_to_avg_SAT'] = largest_std_dev['std_SAT'] / largest_std_dev['average_SAT']

In [10]:
largest_std_dev.round(2)

         borough  num_schools  average_SAT  std_SAT  prop_std_to_avg_SAT
0      Manhattan           89      1340.13   230.29                 0.17
1  Staten Island           10      1439.00   222.30                 0.15
2         Queens           69      1345.48   195.25                 0.15
3       Brooklyn          109      1230.26   154.87                 0.13
4          Bronx           98      1202.72   150.39                 0.13

In [12]:
largest_std_dev['average_SAT'].describe()

count       5.000000
mean     1311.518893
std        95.738289
min      1202.724490
25%      1230.256881
50%      1340.134831
75%      1345.478261
max      1439.000000
Name: average_SAT, dtype: float64